
===========================================================================
report_tns
============================================================================
tns -132.69

===========================================================================
report_wns
============================================================================
wns -9.19

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -9.19

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.46
