
===========================================================================
report_tns
============================================================================
tns -121.89

===========================================================================
report_wns
============================================================================
wns -8.13

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -8.13

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.40
