
===========================================================================
report_tns
============================================================================
tns -119.58

===========================================================================
report_wns
============================================================================
wns -8.67

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -8.67

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.29
